Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
<?xml version='1.0' encoding='ASCII'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>SAML11_DFP</name>
   <description>Microchip SAML11 Series Device Support</description>
   <releases>
      <release version="3.2.86" date="2020-04-28">Update MSP, PSP, PRIMASK and CONTROL registers for Secure mode for MPLAB X. Updated &#956;Vision support files. Updated MPLAB X debug scripts.</release>
      <release version="3.1.75" date="2020-02-12">Updated XOSC32K startup time value-group for OSC32KCTRL module. Added value-groups for SERCOM module. Updated XC32 content. Updated MPLAB X debug scripts.</release>
      <release version="3.0.48" date="2019-10-08">Updated captions and registers in CCL, EIC, GCLK, OPAMP, OSC32KCTRL, OSCCTRL, RTC, SERCOM and SUPC. Added XC32 content. Updated programming and debugging scripts.</release>
      <release version="2.0.33" date="2019-04-29">Fixes. Succeeds Atmel.SAML11_DFP 1.0.91.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAML11</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAML11" Dvendor="Microchip:3">
         <description>The Microchip SAM L11 family of microcontrollers is based on the Arm&#174; Cortex&#174;-M23 core, featuring Arm TrustZone&#174; technology for ARMv8M, a programmable environment that provides hardware isolation between certified libraries, IP and application code.
		
		In addition to TrustZone, the SAML11 security features include an on-board cryptographic module  supporting Advanced Encryption Standard (AES), Galois Counter Mode (GCM) and Secure Hash Algorithm (SHA). The secure boot and secure key storage with tamper detection capabilities establish hardware root of trust. It also offers secure bootloader for secure firmware upgrades.
		
		SAML11 is ultra-low power and offers latest generation Peripheral Touch Controller (PTC) for capacitive touch capabilities. The PTC adds Driven Shield Plus to provide superior water tolerance and excellent noise immunity enabling elegant touch interfaces. The SAML10/L11 family is ideal for a myriad of IoT and security, automotive, appliance, medical and consumer applications whether hardwired or battery powered.
        </description>
         <flashinfo name="NVM User Row (UROW)" start="0x00804000" blankval="0xFFFFFFFF" pagesize="0x00000020" ptime="100000" etime="1000000">
            <block count="1" size="0x20" arg="0"/>
        </flashinfo>
         <flashinfo name="NVM Boot Configuration Row (BOCOR)" start="0x0080C000" blankval="0xFFFFFFFF" pagesize="0x00000100" ptime="100000" etime="1000000">
            <block count="1" size="0x100" arg="0"/>
        </flashinfo>
         <debugvars configfile="keil/debug/SAML11.dbgconf">
          // Debugger Setup
          __var CE_Select               = 0x00000002;
          __var CE0_Keyword0            = 0xFFFFFFFF;
          __var CE0_Keyword1            = 0xFFFFFFFF;
          __var CE0_Keyword2            = 0xFFFFFFFF;
          __var CE0_Keyword3            = 0xFFFFFFFF;
          __var CE1_Keyword0            = 0xFFFFFFFF;
          __var CE1_Keyword1            = 0xFFFFFFFF;
          __var CE1_Keyword2            = 0xFFFFFFFF;
          __var CE1_Keyword3            = 0xFFFFFFFF;
          __var CE2_Keyword0            = 0xFFFFFFFF;
          __var CE2_Keyword1            = 0xFFFFFFFF;
          __var CE2_Keyword2            = 0xFFFFFFFF;
          __var CE2_Keyword3            = 0xFFFFFFFF;
          // Device Setup
          __var ProgramDebugAccessLevel = 0x00000002;
          __var UROW_Program            = 0x00000000;
          __var BOCOR_Program           = 0x00000000;
          //   UROW Configuration
          __var UROW_Config0            = 0x0000E03F;
          __var UROW_Config1            = 0x00001800;
          __var UROW_Config2            = 0x7F0800FF;
          __var UROW_Config3            = 0x00000001;
          __var UROW_NONSECA            = 0x00000000;
          __var UROW_NONSECB            = 0x00000000;
          __var UROW_NONSECC            = 0x00000000;
          //   BOCOR Configuration
          __var BOCOR_Config0           = 0xA0000000;
          __var BOCOR_Config1           = 0x00030000;
          __var BOCOR_ROMVersion        = 0x0000003A;
          __var BOCOR_CE0_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CE0_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CE0_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CE0_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CE1_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CE2_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword0      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword1      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword2      = 0xFFFFFFFF;
          __var BOCOR_CRC_Keyword3      = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword0     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword1     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword2     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword3     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword4     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword5     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword6     = 0xFFFFFFFF;
          __var BOCOR_BOOT_Keyword7     = 0xFFFFFFFF;
        </debugvars>
         <sequences>                                                                <!-- added by ARM -->
        
            <sequence name="ResetHardwareAssert">
               <block>
                __var nReset = 0x80;
              
