Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
            <sequence name="ColdPlugin">
               <block>
              DAP_SWJ_Pins(0x00, 0x01, 0);  // Pull down SWCLK/TCK for cold-plugin
              Sequence("ResetHardwareDeassertDefault");
            </block>
            </sequence>

            <!-- Check Boot ROM Status and Flag Errors-->
            <sequence name="Bootrom_CheckError">
               <block>
              __var DSU_BCC1_Addr = 0x41002124;  // Access DSU External Address Range (for all DALs)
              __var DSU_BCC1_Val  = 0;
              __var msgType       = 0;

              DSU_BCC1_Val = Read32(DSU_BCC1_Addr);
            </block>
               <control if="(DSU_BCC1_Val &gt;= 0xEC000010) &amp;&amp; (DSU_BCC1_Val &lt;= 0xEC000015)" info="error?">
                  <block>
                msgType = 1;
              </block>
               </control>
               <control if="(DSU_BCC1_Val &gt;= 0xEC000022) &amp;&amp; (DSU_BCC1_Val &lt;= 0xEC000023)" info="error?">
                  <block>
                msgType = 2;
              </block>
               </control>
               <control if="(DSU_BCC1_Val == 0xEC000025)" info="error?">
                  <block>
                msgType = 1;
              </block>
               </control>
               <control if="(DSU_BCC1_Val &gt;= 0xEC000027) &amp;&amp; (DSU_BCC1_Val &lt;= 0xEC000036)" info="error?">
                  <block>
                msgType = 2;
              </block>
               </control>
               <control if="(DSU_BCC1_Val &gt;= 0xEC000040) &amp;&amp; (DSU_BCC1_Val &lt;= 0xEC0000F0)" info="error?">
                  <block>
                msgType = 1;
              </block>
               </control>
            
               <control if="msgType == 2">
                  <block>
                Sequence("ResetPulse");                 // Bring device (and boot ROM) back into defined state
              </block>
               </control>
               <control if="msgType &gt; 0">
                  <block>
                Message(msgType, "Boot ROM error - 0x%08X", DSU_BCC1_Val);
              </block>
               </control>
            </sequence>


            <sequence name="CheckForChecksumError">
               <block>
              __var DSU_BCC1_Addr      = 0x41002124;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC1_Val       = 0;
              __var ChecksumErr        = 0;
              
              DSU_BCC1_Val = Read32(DSU_BCC1_Addr);
              ChecksumErr = (DSU_BCC1_Val == 0xEC000011) || (DSU_BCC1_Val == 0xEC000013) || (DSU_BCC1_Val == 0xEC000041) || (DSU_BCC1_Val == 0xEC000041);
            </block>
               <control if="ChecksumErr">
                  <block>
                Query(0, "Checksum/hash error!\nErase and reprogram chip under reset.", 1);
                Message(2, "Checksum/hash error (0x%08X)! Erase and reprogram chip under reset.", DSU_BCC1_Val);
              </block>
               </control>
            </sequence>
          

          
            <!-- Establish Connection to Boot ROM -->
            <sequence name="Bootrom_Connect">
               <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              
              Write32(DSU_Ctrl_Stat_Addr, 0x00001C00);  // Clear Error Flags in DSU.STATA (PERR, FAIL, BERR)
              Write32(DSU_Ctrl_Stat_Addr, 0x00000200);  // Clear CPU Reset Extension in DSU.STATA
              DAP_Delay(5000);                          // Wait 5 ms after CPU Release
              Sequence("Bootrom_CheckError");           // Check Boot ROM Status
            </block>
            </sequence>
          
            <!-- Enter Interactive Boot ROM Mode -->
            <sequence name="Bootrom_CMD_INIT">
               <block>
              __var DSU_BCC0_Addr = 0x41002120;         // Access DSU External Address Range (for all DALs)
              
              Write32(DSU_BCC0_Addr, 0x44424755);       // Write CMD_INIT
              Sequence("Bootrom_CheckError");
            </block>
            </sequence>
          
            <!-- Execute Full Chip Erase -->
            <sequence name="Bootrom_CMD_CEx" info="Selected Chip Erase">
               <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC0_Addr      = 0x41002120;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC1_Addr      = 0x41002124;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC1_Val       = 0;
              __var CE_Keyword0        = CE2_Keyword0;  // CE2_Keyword0 by default
              __var CE_Keyword1        = CE2_Keyword1;  // CE2_Keyword1 by default
              __var CE_Keyword2        = CE2_Keyword2;  // CE2_Keyword2 by default
              __var CE_Keyword3        = CE2_Keyword3;  // CE2_Keyword3 by default
              __var CE_CMD             = 0x444247E2;    // CMD_CE2 by default
              
              Message(0, "Execute Chip Erase (CE%u)...", CE_Select);
            </block>
            
               <control if="CE_Select == 0" info="Set CE0 Parameters">
                  <block>
                CE_CMD      = 0x444247E0;         // Use CE0
                CE_Keyword0 = CE0_Keyword0;       // Use CE0_Keyword0
                CE_Keyword1 = CE0_Keyword1;       // Use CE0_Keyword1
                CE_Keyword2 = CE0_Keyword2;       // Use CE0_Keyword2
                CE_Keyword3 = CE0_Keyword3;       // Use CE0_Keyword3
              </block>
               </control>
            
               <control if="CE_Select == 1" info="Set CE1 Parameters">
                  <block>
                CE_CMD      = 0x444247E1;         // Use CE1
                CE_Keyword0 = CE1_Keyword0;       // Use CE1_Keyword0
                CE_Keyword1 = CE1_Keyword1;       // Use CE1_Keyword1
                CE_Keyword2 = CE1_Keyword2;       // Use CE1_Keyword2
                CE_Keyword3 = CE1_Keyword3;       // Use CE1_Keyword3
              </block>
               </control>

               <block>
              Write32(DSU_BCC0_Addr, CE_CMD);           // Write CMD_CE1
              Sequence("Bootrom_CheckError");
            </block>
            
               <block>
              Write32(DSU_BCC0_Addr, CE_Keyword0);      // Write CE_Keyword0
            </block>
               <control while="(Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00400000)" timeout="1000000" info="Poll DSU STATUSB.BCCD0 until cleared"/>
               <block>
              Write32(DSU_BCC0_Addr, CE_Keyword1);      // Write CE_Keyword1
            </block>
               <control while="(Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00400000)" timeout="1000000" info="Poll DSU STATUSB.BCCD0 until cleared"/>
               <block>
              Write32(DSU_BCC0_Addr, CE_Keyword2);      // Write CE_Keyword2
            </block>
               <control while="(Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00400000)" timeout="1000000" info="Poll DSU STATUSB.BCCD0 until cleared"/>
               <block>
              Write32(DSU_BCC0_Addr, CE_Keyword3);      // Write CE_Keyword3
            </block>
               <control while="(Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00400000)" timeout="1000000" info="Poll DSU STATUSB.BCCD0 until cleared"/>
               <control while="(DSU_BCC1_Val = Read32(DSU_BCC1_Addr)) != 0xEC000021" timeout="3000000" info="Wait for SIG_CMD_SUCCESS">
                  <block>
                Sequence("Bootrom_CheckError");
              </block>
               </control>
            </sequence>

