Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
              __errorcontrol = 0;                                              // check errors

              Sequence("BootDelay");
            </block>

               <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
               <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) != 0" timeout="100000"/>

               <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
            </sequence>

            <!-- VECTRESET - Disabled -->
            <sequence name="ResetProcessor" disable="true" info="VECTRESET">
            <!-- ResetProcessor not available for CM23 -->
          </sequence>

            <sequence name="ResetPulse">
               <block>
              __var nReset      = 0x80;
              __var SWCLK_TCK   = 0x01;
              __var canReadPins = 0;

              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
            </block>

               <control while="(DAP_SWJ_Pins(0x00, nReset, 0) &amp; nReset) == nReset" timeout="1000000"/>

               <!-- Keep reset active for 50 ms -->
               <block>
              DAP_Delay(50000);
            </block>
            
               <block>
              DAP_SWJ_Pins(SWCLK_TCK, SWCLK_TCK, 0);  // Make sure that SWCLK/TCK is HIGH for SAML11 hot-plugin
            </block>

               <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
                  <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
               </control>

               <control if="!canReadPins">
                  <block>
                DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
                DAP_Delay(100000);                                             // Wait 100ms for recovery if nRESET not readable
              </block>
               </control>
            </sequence>

            <!-- HW Reset -->
            <sequence name="ResetHardware" info="HW RESET">
               <block>
              Sequence("ResetPulse");
              Sequence("BootDelay");
              Sequence("DebugPortSetup");
              Sequence("DebugPortStart");
            </block>
            </sequence>

            <!-- Stop After Bootloader -->
            <sequence name="ResetCatchSet">
               <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;  // Access DSU External Address Range (for all DALs)
              __var DHCSR_Addr         = 0xE000EDF0;
              __var DEMCR_Addr         = 0xE000EDFC;
              __var FP_CTRL_Addr       = 0xE0002000;
              __var FP_COMP0_Addr      = 0xE0002008;
              __var FPB_KEY            = 0x00000002;
              __var FPB_ENABLE         = 0x00000001;
              __var DWT_COMP0_Addr     = 0xE0001020;
              __var DWT_FUNCTION0_Addr = 0xE0001028;
              __var DWT_COMP1_Addr     = 0xE0001030;
              __var DWT_FUNCTION1_Addr = 0xE0001038;
              __var DebugAccessLevel   = 0;
              __var value              = 0;
              __var resetVect          = 0x00000000;
              
              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>
            
               <control if="DebugAccessLevel == 2" info="Use Secure Reset Vector">
                  <block>
                value = Read32(DEMCR_Addr);
                Write32(DEMCR_Addr, (value &amp; ~0x00000001));                  // Disable Reset Vector Catch


                resetVect = Read32(0x00000004);                                  // Read Reset Vector
                Write32(FP_COMP0_Addr, (resetVect | FPB_ENABLE));                // Set BP0 to Reset Vector (ARMv8M)
                Write32(FP_CTRL_Addr,  (FPB_KEY   | FPB_ENABLE));                // Enable FPB
              </block>
               </control>
            
               <control if="DebugAccessLevel == 1" info="Use Instruction Address Range Match for DAL1">
                  <block>
                Write32(DWT_FUNCTION0_Addr, 0x00000412);                         // DWT_FUNCTION0: DATAVSIZE - 2, ACTION - Debug Event, MATCH - Instrucion Address
                Write32(DWT_COMP0_Addr,     0x00000000);                         // DWT_COMP0: Start of available code flash
                Write32(DWT_COMP1_Addr,     0x00400000);                         // DWT_COMP1: Start of available data flash
                Write32(DWT_FUNCTION1_Addr, 0x00000403);                         // DWT_FUNCTION1: DATAVSIZE - 2, ACTION - Trigger only, MATCH - Instrucion Address Limit
                
                value      = Read32(DEMCR_Addr);                                 // Read DEMCR
                value &amp;= ~0x00000001;                                        // Disable Reset Vector Catch
                value     |= 0x01000000;                                         // Ensure TRCENA is set
                Write32(DEMCR_Addr, value);                                      // Write back DEMCR
              </block>
               </control>
            
               <block>
              Read32(DHCSR_Addr);                                                // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            </block>
               <!-- Do nothing for DebugAccessLevel == 0 -->
            
            </sequence>

            <sequence name="ResetCatchClear">
               <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;  // Access DSU External Address Range (for all DALs)
              __var FP_CTRL_Addr       = 0xE0002000;
              __var FP_COMP0_Addr      = 0xE0002008;
              __var FPB_KEY            = 0x00000002;
              __var DWT_COMP0_Addr     = 0xE0001020;
              __var DWT_FUNCTION0_Addr = 0xE0001028;
              __var DWT_COMP1_Addr     = 0xE0001030;
              __var DWT_FUNCTION1_Addr = 0xE0001038;
              __var DebugAccessLevel   = 0;

              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>
            
               <control if="DebugAccessLevel == 2" info="Clear used FPB resources">
                  <block>
                Write32(FP_COMP0_Addr, 0x00000000);              // Clear BP0
                Write32(FP_CTRL_Addr,  FPB_KEY   );              // Disable FPB
              </block>
               </control>
            
               <control if="DebugAccessLevel == 1" info="Clear used DWT resources">
                  <block>
                Write32(DWT_FUNCTION0_Addr, 0x00000000);         // Clear DWT_FUNCTION0
                Write32(DWT_FUNCTION1_Addr, 0x00000000);         // Clear DWT_FUNCTION1
                Write32(DWT_COMP0_Addr,     0x00000000);         // Clear DWT_COMP0
                Write32(DWT_COMP1_Addr,     0x00000000);         // Clear DWT_COMP1
              </block>
               </control>

            </sequence>
          
            <sequence name="ClearFlashPageBuffer">
               <block>
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;           // Access DSU External Address Range (for DALs)
              __var PageBufferDirty      = 0;
              __var DebugAccessLevel     = 0;
              
              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>

               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                NVMCTRL_Base_Addr += 0x1000;                     // Use secure alias
              </block>
               </control>
            
               <block>
              PageBufferDirty = Read8(NVMCTRL_Base_Addr + 0x18) &amp; 0x02;           // NVMCTRL.STATUS: Check if LOAD bit set (page buffer not empty)
            </block>
            
               <control if="PageBufferDirty" info="Only clear page buffer if necessary. PBC commands can otherwise fail.">
                  <block info="Clear page buffer command">
                Write8 (NVMCTRL_Base_Addr + 0x14, 0x1F);                              // NVMCTRL.INTFLAG: Clear all errors and DONE flag
                Write16(NVMCTRL_Base_Addr, ((0xA5 &lt;&lt; 8) | (0x44 &lt;&lt; 0)));  // NVMCTRL.CTRLA:   Clear page buffer command
              </block>
                  <control while="(Read16(NVMCTRL_Base_Addr + 0x18) &amp; 0x06) != (1 &lt;&lt; 2)" timeout="100000" info="NVMCTRL.STATUS: READY and not LOAD (page buffer cleared)"/>
    
                  <control if="(Read8(NVMCTRL_Base_Addr + 0x14) &amp; 0x1F) != 0x01" info="NVMCTRL.INTFLAG: Check for errors and command done">
                     <block>
                  __Result = -1;                                                      // Clear page buffer finished with errors
                </block>
                  </control>
               </control>
            </sequence>
          

