Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
            <sequence name="PrepareFlashOperation">
               <block info="initalize local variables">
              __var PAC_WRCTRL_Addr      = 0x40000000;
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;  // Access DSU External Address Range (for all DALs)
              __var DebugAccessLevel     = 0;
              
              __Result = 0;                             // Initialize __Result to OK
              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>

               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                PAC_WRCTRL_Addr   += 0x0200;            // Use secure alias
                NVMCTRL_Base_Addr += 0x1000;            // Use secure alias
              </block>
               </control>

               <block info="configure Flash access">
              Write32(PAC_WRCTRL_Addr,          (( 1 &lt;&lt; 16) | (34 &lt;&lt;  0)));  // PAC.WRCTRL: disable NVMCTRL Write Protection via Secure alias
              Write32(NVMCTRL_Base_Addr + 0x04, (( 1 &lt;&lt; 18) | (15 &lt;&lt;  1)));  // NVMCTRL.CTRLB: cache disabled, read wait states = 15
              Write8 (NVMCTRL_Base_Addr + 0x08, (( 1 &lt;&lt;  0)                   ));  // NVMCTRL.CTRLC: manual write
            </block>
            </sequence>
          
          
          
            <!-- CMSIS Flash Algorithm - FlashInit -->
            <sequence name="FlashInit">
               <block>
              Sequence("PrepareFlashOperation");
            </block>
          
               <control if="__FlashOp == 1">
              <!-- special initialization code for erase -->
                  <block>
              </block>
               </control>
               <control if="__FlashOp == 2">
              <!-- special initialization code for program -->
                  <block>
                Sequence("ClearFlashPageBuffer");
              </block>
               </control>
            </sequence>

            <!-- CMSIS Flash Algorithm - FlashUninit -->
            <sequence name="FlashUninit">
               <block info="initalize result to OK">
              __Result = 0;
            </block>
            </sequence>

            <!-- CMSIS Flash Algorithm - FlashEraseChip - Disabled -->
            <sequence name="FlashEraseChip" disable="0">
            <!-- FlashEraseChip not implemented -->
          </sequence>

            <sequence name="EraseUROW">
               <block info="initalize local variables">
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;              // Access DSU External Address Range (for DALs)
              __var IndirectAddressing   = 0;
              __var DebugAccessLevel     = 0;
              __var SectorAddr           = 0x00804000;
              
              Message(0, "Erase UROW...");

              __Result = 0;                                         // Initialize __Result to OK
              
              DebugAccessLevel   = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;           // Read Debug Access Level
              IndirectAddressing = (DebugAccessLevel &lt; 2);                                           // DAL1 and Code/Data Flash
            </block>
            
               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                NVMCTRL_Base_Addr += 0x1000;                        // Use secure alias
              </block>
               </control>

               <block>
              Sequence("PrepareFlashOperation");
              Sequence("ClearFlashPageBuffer");
            </block>

               <block info="Erase row command - Clear Status">
              Write8 (NVMCTRL_Base_Addr + 0x14, 0x1F);              // NVMCTRL.INTFLAG: Clear all errors and DONE flag
            </block>
            
               <control if="IndirectAddressing" info="Erase row command - Set Page Address (Indirect Addressing)">
                  <block>
                Sequence("ClearFlashPageBuffer");
                Write32(SectorAddr, 0xFFFFFFFF);                   // Indirect setting of NVMCTRL.ADDR: Cannot be directly written at DAL1
              </block>
               </control>
               <control if="!IndirectAddressing" info="Erase row command - Set Page Address (Direct Addressing)">
                  <block>
                Write32(NVMCTRL_Base_Addr + 0x1C, SectorAddr);     // NVMCTRL.ADDR: 0..15 offset, 22..23 array (0 = Flash, 1 = DataFlsh, 2= AuxFlash)
              </block>
               </control>
               <block info="Erase row command - Do Erase">
              Write16(NVMCTRL_Base_Addr, ((0xA5 &lt;&lt; 8) | (0x02 &lt;&lt; 0)));  // NVMCTRL.CTRLA: Erase row command
            </block>
            
               <control while="(Read16(NVMCTRL_Base_Addr + 0x18) &amp; (1 &lt;&lt; 2)) == 0" timeout="100000" info="NVMCTRL.STATUS: Wait for operation to finish"/>
               <control if="(Read8(NVMCTRL_Base_Addr + 0x14) &amp; 0x1F) != 0x01" info="NVMCTRL.INTFLAG: Check for errors">
                  <block>
                __Result = -1;                                      // Erase row finished with errors
              </block>
               </control>
            </sequence>
          
            <sequence name="EraseBOCOR">
               <block info="initalize local variables">
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;              // Access DSU External Address Range (for DALs)
              __var IndirectAddressing   = 0;
              __var DebugAccessLevel     = 0;
              __var SectorAddr           = 0x0080C000;
              
              Message(0, "Erase BOCOR...");

              __Result = 0;                                         // Initialize __Result to OK
              
              DebugAccessLevel   = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;           // Read Debug Access Level
              IndirectAddressing = (DebugAccessLevel &lt; 2);                                           // DAL1 and Code/Data Flash
            </block>
            
               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                NVMCTRL_Base_Addr += 0x1000;                        // Use secure alias
              </block>
               </control>

               <control while="__Result == 0 &amp;&amp; (SectorAddr &lt; 0x0080C100)">
                  <block>
                Sequence("PrepareFlashOperation");
                Sequence("ClearFlashPageBuffer");
              </block>
  
                  <block info="Erase row command - Clear Status">
                Write8 (NVMCTRL_Base_Addr + 0x14, 0x1F);              // NVMCTRL.INTFLAG: Clear all errors and DONE flag
              </block>
              
                  <control if="IndirectAddressing" info="Erase row command - Set Page Address (Indirect Addressing)">
                     <block>
                  Sequence("ClearFlashPageBuffer");
                  Write32(SectorAddr, 0xFFFFFFFF);                   // Indirect setting of NVMCTRL.ADDR: Cannot be directly written at DAL1
                </block>
                  </control>
                  <control if="!IndirectAddressing" info="Erase row command - Set Page Address (Direct Addressing)">
                     <block>
                  Write32(NVMCTRL_Base_Addr + 0x1C, SectorAddr);     // NVMCTRL.ADDR: 0..15 offset, 22..23 array (0 = Flash, 1 = DataFlsh, 2= AuxFlash)
                </block>
                  </control>
                  <block info="Erase row command - Do Erase">
                Write16(NVMCTRL_Base_Addr, ((0xA5 &lt;&lt; 8) | (0x02 &lt;&lt; 0)));  // NVMCTRL.CTRLA: Erase row command
              </block>
              
                  <control while="(Read16(NVMCTRL_Base_Addr + 0x18) &amp; (1 &lt;&lt; 2)) == 0" timeout="100000" info="NVMCTRL.STATUS: Wait for operation to finish"/>
                  <control if="(Read8(NVMCTRL_Base_Addr + 0x14) &amp; 0x1F) != 0x01" info="NVMCTRL.INTFLAG: Check for errors">
                     <block>
                  __Result = -1;                                      // Erase row finished with errors
                </block>
                  </control>
              
                  <block>
                SectorAddr += 0x20;
              </block>
               </control>
           
            </sequence>

            <sequence name="EraseBSHashRow">
               <block info="initalize local variables">
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;              // Access DSU External Address Range (for DALs)
              __var IndirectAddressing   = 0;
              __var DebugAccessLevel     = 0;
              __var SectorAddr           = 0x00000000;
              __var SectorSize           = 0x100;
              __var BS_HashAddr          = 0x00000000;
              __var BS_Length            = 0;
              __var BNSC_Length          = 0;
              __var BS_Setup             = 0;
              
              Message(0, "Erase Row for Boot Image hashsum...");

              __Result = 0;                                         // Initialize __Result to OK
              
              DebugAccessLevel   = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16; // Read Debug Access Level
              IndirectAddressing = (DebugAccessLevel &lt; 2);                                 // DAL1 and Code/Data Flash
              
