Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
              BS_Setup     = Read32(0x0080C000);
              BS_Length    = (BS_Setup &amp; 0x0000FF00) &gt;&gt;  8;
              BS_Length   *= 0x100;
              BNSC_Length  = (BS_Setup &amp; 0x007F0000) &gt;&gt; 16;  // should go into if block
              BNSC_Length *= 0x20;
              BS_HashAddr  = BS_Length - BNSC_Length - 0x20;
              SectorAddr   = BS_HashAddr &amp; ~(SectorSize - 1);
            </block>
            
               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                NVMCTRL_Base_Addr += 0x1000;                        // Use secure alias
              </block>
               </control>

               <block>
              Sequence("PrepareFlashOperation");
              Sequence("ClearFlashPageBuffer");
            </block>

               <block info="Erase row command - Clear Status">
              Write8 (NVMCTRL_Base_Addr + 0x14, 0x1F);              // NVMCTRL.INTFLAG: Clear all errors and DONE flag
            </block>
            
               <control if="IndirectAddressing" info="Erase row command - Set Page Address (Indirect Addressing)">
                  <block>
                Sequence("ClearFlashPageBuffer");
                Write32(SectorAddr, 0xFFFFFFFF);                   // Indirect setting of NVMCTRL.ADDR: Cannot be directly written at DAL1
              </block>
               </control>
               <control if="!IndirectAddressing" info="Erase row command - Set Page Address (Direct Addressing)">
                  <block>
                Write32(NVMCTRL_Base_Addr + 0x1C, SectorAddr);     // NVMCTRL.ADDR: 0..15 offset, 22..23 array (0 = Flash, 1 = DataFlsh, 2= AuxFlash)
              </block>
               </control>
               <block info="Erase row command - Do Erase">
              Write16(NVMCTRL_Base_Addr, ((0xA5 &lt;&lt; 8) | (0x02 &lt;&lt; 0)));  // NVMCTRL.CTRLA: Erase row command
            </block>
            
               <control while="(Read16(NVMCTRL_Base_Addr + 0x18) &amp; (1 &lt;&lt; 2)) == 0" timeout="100000" info="NVMCTRL.STATUS: Wait for operation to finish"/>
               <control if="(Read8(NVMCTRL_Base_Addr + 0x14) &amp; 0x1F) != 0x01" info="NVMCTRL.INTFLAG: Check for errors">
                  <block>
                __Result = -1;                                      // Erase row finished with errors
              </block>
               </control>
           
            </sequence>
          

            <!-- CMSIS Flash Algorithm - FlashEraseSector -->
            <sequence name="FlashEraseSector">
               <block info="initalize local variables">
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;              // Access DSU External Address Range (for DALs)
              __var IndirectAddressing   = 0;
              __var DebugAccessLevel     = 0;
              
              // Message(0, "Erase Row: 0x%08X...", __FlashAddr);

              __Result = 0;                                         // Initialize __Result to OK
              
              DebugAccessLevel   = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;           // Read Debug Access Level
              IndirectAddressing = (DebugAccessLevel &lt; 2);                                           // DAL1 and Code/Data Flash
            </block>
            
               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                NVMCTRL_Base_Addr += 0x1000;                        // Use secure alias
              </block>
               </control>

               <block info="Erase row command - Clear Status">
              Write8 (NVMCTRL_Base_Addr + 0x14, 0x1F);              // NVMCTRL.INTFLAG: Clear all errors and DONE flag
            </block>
            
               <control if="IndirectAddressing" info="Erase row command - Set Page Address (Indirect Addressing)">
                  <block>
                Sequence("ClearFlashPageBuffer");
                Write32(__FlashAddr, 0xFFFFFFFF);                   // Indirect setting of NVMCTRL.ADDR: Cannot be directly written at DAL1
              </block>
               </control>
               <control if="!IndirectAddressing" info="Erase row command - Set Page Address (Direct Addressing)">
                  <block>
                Write32(NVMCTRL_Base_Addr + 0x1C, __FlashAddr);     // NVMCTRL.ADDR: 0..15 offset, 22..23 array (0 = Flash, 1 = DataFlsh, 2= AuxFlash)
              </block>
               </control>
               <block info="Erase row command - Do Erase">
              Write16(NVMCTRL_Base_Addr, ((0xA5 &lt;&lt; 8) | (0x02 &lt;&lt; 0)));  // NVMCTRL.CTRLA: Erase row command
            </block>
            
               <control while="(Read16(NVMCTRL_Base_Addr + 0x18) &amp; (1 &lt;&lt; 2)) == 0" timeout="100000" info="NVMCTRL.STATUS: Wait for operation to finish"/>
               <control if="(Read8(NVMCTRL_Base_Addr + 0x14) &amp; 0x1F) != 0x01" info="NVMCTRL.INTFLAG: Check for errors">
                  <block>
                __Result = -1;                                      // Erase row finished with errors
              </block>
               </control>
            
            </sequence>

          
            <sequence name="ExecPageWrite">
               <block>
              __var NVMCTRL_Base_Addr    = 0x41004000;
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;              // Access DSU External Address Range (for DALs)
              __var DebugAccessLevel     = 0;

              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>
            
               <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
                  <block>
                NVMCTRL_Base_Addr += 0x1000;                        // Use secure alias
              </block>
               </control>

