Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
               <block info="Write page command">
              Write8 (NVMCTRL_Base_Addr + 0x14, 0x1F);                                     // NVMCTRL.INTFLAG: Clear all errors and DONE flag
              Write16(NVMCTRL_Base_Addr,        ((0xA5 &lt;&lt; 8) | (0x04 &lt;&lt; 0)));  // NVMCTRL.CTRLA: Write page command
            </block>
               <control while="(Read16(NVMCTRL_Base_Addr + 0x18) &amp; (1 &lt;&lt; 2)) == 0" timeout="100000" info="NVMCTRL.STATUS"/>
            
               <control if="(Read8(NVMCTRL_Base_Addr + 0x14) &amp; 0x1F) != 0x01" info="NVMCTRL.INTFLAG: Check for errors and command done">
                  <block>
                __Result = -1;                                                             // Write page finished with errors
              </block>
               </control>
            
            </sequence>
          
            <!-- CMSIS Flash Algorithm - FlashProgramPage -->
            <sequence name="FlashProgramPage">
               <block info="initalize local variables">
              __var write_size           = __FlashLen;
              
              // Message(0, "Program Page: 0x%08X...", __FlashAddr);

              __Result   = 0;                                            // Initialize __Result to OK
              write_size = (__FlashLen + 3) &amp; ~3;                    // Adjust size to word
              FlashWriteBuffer (__FlashAddr, 0, write_size, (32 | 1) );  // Write Page Buffer
              Sequence("ExecPageWrite");                                 // Execute the page write
            </block>
            </sequence>
          
            <!-- UROW Programming based on dbgconf setup -->
            <sequence name="ProgramUROW">
               <block>
              __var value = 0;
            </block>
            
               <control if="UROW_Program">
                  <block>
                // Prepare UROW Content Buffer
                BufferSet(0, 0x00, 0x20, 1, 0xFF);

                // Read BOD12 setup from target (must not be changed, calibrated in factory)
                value  = (Read32(0x00804000) &amp; 0x01FF0000);
                value |= UROW_Config0 &amp; 0xFE00FFFF;
                
                // Set UROW contents for programming
                BufferSet(0, 0x00, 0x01, 4, value);
                BufferSet(0, 0x04, 0x01, 4, UROW_Config1);
                BufferSet(0, 0x08, 0x01, 4, UROW_Config2);
                BufferSet(0, 0x0C, 0x01, 4, UROW_Config3);
                BufferSet(0, 0x10, 0x01, 4, UROW_NONSECA);
                BufferSet(0, 0x14, 0x01, 4, UROW_NONSECB);
                BufferSet(0, 0x18, 0x01, 4, UROW_NONSECC);
                
                // Generate UROW Checksum
                Message (0, "Generate UROW checksum...");
                BufferStreamOut(0, 0x08, 0x14, "$P/UROW_contents.bin", 0, 0);
                RunApplication("$S/keil/utilities/GenerateCRC.exe", "\"$P/UROW_contents.bin\" -o \"$P/UROW_crc32.bin\"", "$P", 10000000);
                BufferStreamIn(0, 0x1C, 0x4, "$P/UROW_crc32.bin", 0, 0);
                
                // Erase UROW
                Sequence("EraseUROW");
                
                // Program UROW
                Message (0, "Program UROW...");
                Sequence("PrepareFlashOperation");
                Sequence("ClearFlashPageBuffer");
                BufferWrite(0, 0, 0x00804000, 0x20, 32|1);
                Sequence("ExecPageWrite");
              </block>
               </control>
            </sequence>

            <!-- BOCOR Programming based on dbgconf setup -->
            <sequence name="ProgramBOCOR">
               <block>
              __var PageOffset = 0x00000000;
              __var BOCOR_Addr = 0x0080C000;
              __var BS_BootOpt  = 0;
            </block>
            
               <control if="BOCOR_Program">
                  <block>
                // Prepare BOCOR Content Buffer
                BufferSet(0, 0x00, 0x100, 1, 0xFF);
                
                // Set BOCOR contents for programming - Part 1
                BufferSet(0, 0x00, 0x01, 4, BOCOR_Config0);
                BufferSet(0, 0x04, 0x01, 4, BOCOR_Config1);
                
                // Generate BOCOR Checksum
                Message (0, "Generate BOCOR checksum...");
                BufferStreamOut(0, 0, 0x08, "$P/BOCOR_contents_crc32.bin", 0, 0);
                RunApplication("$S/keil/utilities/GenerateCRC.exe", "\"$P/BOCOR_contents_crc32.bin\" -o \"$P/BOCOR_crc32.bin\"", "$P", 10000000);
                BufferStreamIn(0, 0x08, 0x04, "$P/BOCOR_crc32.bin", 0, 0);
                
                // Set BOCOR contents for programming - Part 2
                BufferSet(0, 0x0C, 0x01, 4, BOCOR_ROMVersion);
                
                BufferSet(0, 0x10, 0x01, 4, BOCOR_CE0_Keyword0);
                BufferSet(0, 0x14, 0x01, 4, BOCOR_CE0_Keyword1);
                BufferSet(0, 0x18, 0x01, 4, BOCOR_CE0_Keyword2);
                BufferSet(0, 0x1C, 0x01, 4, BOCOR_CE0_Keyword3);
                
                BufferSet(0, 0x20, 0x01, 4, BOCOR_CE1_Keyword0);
                BufferSet(0, 0x24, 0x01, 4, BOCOR_CE1_Keyword1);
                BufferSet(0, 0x28, 0x01, 4, BOCOR_CE1_Keyword2);
                BufferSet(0, 0x2C, 0x01, 4, BOCOR_CE1_Keyword3);

                BufferSet(0, 0x30, 0x01, 4, BOCOR_CE2_Keyword0);
                BufferSet(0, 0x34, 0x01, 4, BOCOR_CE2_Keyword1);
                BufferSet(0, 0x38, 0x01, 4, BOCOR_CE2_Keyword2);
                BufferSet(0, 0x3C, 0x01, 4, BOCOR_CE2_Keyword3);
                
                BufferSet(0, 0x40, 0x01, 4, BOCOR_CRC_Keyword0);
                BufferSet(0, 0x44, 0x01, 4, BOCOR_CRC_Keyword1);
                BufferSet(0, 0x48, 0x01, 4, BOCOR_CRC_Keyword2);
                BufferSet(0, 0x4C, 0x01, 4, BOCOR_CRC_Keyword3);
                
                BufferSet(0, 0x50, 0x01, 4, BOCOR_BOOT_Keyword0);
                BufferSet(0, 0x54, 0x01, 4, BOCOR_BOOT_Keyword1);
                BufferSet(0, 0x58, 0x01, 4, BOCOR_BOOT_Keyword2);
                BufferSet(0, 0x5C, 0x01, 4, BOCOR_BOOT_Keyword3);

                BufferSet(0, 0x60, 0x01, 4, BOCOR_BOOT_Keyword4);
                BufferSet(0, 0x64, 0x01, 4, BOCOR_BOOT_Keyword5);
                BufferSet(0, 0x68, 0x01, 4, BOCOR_BOOT_Keyword6);
                BufferSet(0, 0x6C, 0x01, 4, BOCOR_BOOT_Keyword7);

                // Determine BOOTOPT setting for hashsum
                BS_BootOpt = (BOCOR_Config0 &amp; 0x03000000) &gt;&gt; 24;

                Message (0, "Generate BOCOR hashsum...");
              </block>
                
                  <control if="BS_BootOpt &lt; 2">
                     <block>
                  // Write hashsum input
                  BufferStreamOut(0, 0, 0xE0, "$P/BOCOR_contents.bin", 0x00, 0);  // Write BOCOR contents
                </block>
                  </control>

                  <control if="BS_BootOpt &gt;= 2">
                     <block>
                  // Write hashsum input (including 2*BOOTKEY)
                  BufferStreamOut(0, 0x50, 0x20, "$P/BOCOR_contents.bin", 0x00, 0);  // Write  BOOTKEY: First Time
                  BufferStreamOut(0, 0x50, 0x20, "$P/BOCOR_contents.bin", 0x10, 0);  // Append BOOTKEY: Second Time
                  BufferStreamOut(0, 0x00, 0xE0, "$P/BOCOR_contents.bin", 0x10, 0);  // Append BOCOR contents
                </block>
                  </control>

                  <block>
                // Generate hashsum
                RunApplication("$S/keil/utilities/GenerateSHA.exe", "\"$P/BOCOR_contents.bin\" -o \"$P/BOCOR_sha256.bin\"", "$P", 10000000);
                BufferStreamIn(0, 0xE0, 0x20, "$P/BOCOR_sha256.bin", 0, 0);
                
