Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/Microchip.SAML11_DFP.pdsc
         <device Dname="ATSAML11E16A">
            <processor Dcore="Cortex-M23" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU" Dtz="TZ"/>
            <compile header="include/sam.h" define="__SAML11E16A__"/>
            <debug svd="svd/ATSAML11E16A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x10000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x800"/>
            <memory id="IRAM1" start="0x20000000" size="0x4000" default="1"/>
            <flashinfo name="Internal Flash (code) 64KB" start="0x00000000" blankval="0xFFFFFFFF" pagesize="0x00000040" ptime="100000" etime="1000000">
              <block count="256" size="0x100" arg="0"/>       
               <!-- Sector Size 256B (1 row = 4 * page a 64 Byte) -->
            </flashinfo>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/ATSAML11E16A.atdf"/>
                  <at:variant ordercode="ATSAML11E16A-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="ATSAML11E16A-MF" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="ATSAML11E16A-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="ATSAML11E16A-AF" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="ATSAML11E16A-UU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x10000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AUX" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="BOCOR" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="DATAFLASH" start="0x00400000" size="0x800" type="flash" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="SW_CALIB" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806038" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="APBA" start="0x40000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="APBB" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="APBC" start="0x42000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/ATSAML11E16A.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/8bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/16bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="emu">
                     <mchp:file name="hwtools/emu/PK3OBDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/Simulator.emu"/>
                     <mchp:file name="hwtools/emu/ICD4ToolBase.emu"/>
                     <mchp:file name="hwtools/emu/SnapToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/RI4ToolBase.emu"/>
                     <mchp:file name="hwtools/emu/ICD3DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/SKDEManager.emu"/>
                     <mchp:file name="hwtools/emu/PICkit3DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/PKOB4ToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/PICkit2DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/AtmelIceBase.emu"/>
                     <mchp:file name="hwtools/emu/RIDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/Pk4HybridTooImpl.emu"/>
                     <mchp:file name="hwtools/emu/PKOBSKDEDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/AtmelIceScriptingBase.emu"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="tex">
                     <mchp:file name="hwtools/tex/PK4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/PKOBSKDEDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/RI4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/ICD4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/RIDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PK3OBDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/SKDEManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PICkit2DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PICkit3DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/SnapToolImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/Pk4HybridTooImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/PgmToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/AtmelIceScriptingBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/ICD3DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PKOB4ToolImpl.toolMediator"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pkg">
                     <mchp:file name="hwtools/pkg/pkg.pkg"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pk4">
                     <mchp:file name="hwtools/pk4/pk4.pk4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="per">
                     <mchp:file name="hwtools/per/pic18.per"/>
                     <mchp:file name="hwtools/per/pic32.per"/>
                     <mchp:file name="hwtools/per/dspic.per"/>
                     <mchp:file name="hwtools/per/pic16.per"/>
                     <mchp:file name="hwtools/per/armcm7.per"/>
                     <mchp:file name="hwtools/per/avr8.per"/>
                     <mchp:file name="hwtools/per/pic12.per"/>
                     <mchp:file name="hwtools/per/usart.ispPeripheral.xml"/>
                     <mchp:file name="hwtools/per/usart.plibgen.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="icd4">
                     <mchp:file name="hwtools/icd4/icd4.icd4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="ice4">
                     <mchp:file name="hwtools/ice4/ice4.ice4"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML11E16A" title="Device page for ATSAML11E16A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML11E16A" title="Datasheet"/>
         </device>
         <device Dname="ATSAML11E14A">
            <processor Dcore="Cortex-M23" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU" Dtz="TZ"/>
            <compile header="include/sam.h" define="__SAML11E14A__"/>
            <debug svd="svd/ATSAML11E14A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x4000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x800"/>
            <memory id="IRAM1" start="0x20000000" size="0x2000" default="1"/>
            <flashinfo name="Internal Flash (code) 16KB" start="0x00000000" blankval="0xFFFFFFFF" pagesize="0x00000040" ptime="100000" etime="1000000">
              <block count="64" size="0x100" arg="0"/>        
               <!-- Sector Size 256B (1 row = 4 * page a 64 Byte) -->
            </flashinfo>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/ATSAML11E14A.atdf"/>
                  <at:variant ordercode="ATSAML11E14A-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="ATSAML11E14A-MF" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="ATSAML11E14A-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="ATSAML11E14A-AF" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="ATSAML11E14A-UU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x4000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AUX" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="BOCOR" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="DATAFLASH" start="0x00400000" size="0x800" type="flash" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="SW_CALIB" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806038" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="APBA" start="0x40000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="APBB" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="APBC" start="0x42000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/ATSAML11E14A.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.nmmrs">
                     <mchp:file name="hwtools/mplab/avr.8bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/8bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/32bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/arm.32bit.NMMRs.xml"/>
                     <mchp:file name="hwtools/mplab/16bit.NMMRs.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.devicesupport">
                     <mchp:file name="hwtools/mplab/mplab.deviceSupport"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="emu">
                     <mchp:file name="hwtools/emu/PK3OBDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/Simulator.emu"/>
                     <mchp:file name="hwtools/emu/ICD4ToolBase.emu"/>
                     <mchp:file name="hwtools/emu/SnapToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/RI4ToolBase.emu"/>
                     <mchp:file name="hwtools/emu/ICD3DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/SKDEManager.emu"/>
                     <mchp:file name="hwtools/emu/PICkit3DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/PKOB4ToolImpl.emu"/>
                     <mchp:file name="hwtools/emu/PICkit2DbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/AtmelIceBase.emu"/>
                     <mchp:file name="hwtools/emu/RIDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/Pk4HybridTooImpl.emu"/>
                     <mchp:file name="hwtools/emu/PKOBSKDEDbgToolManager.emu"/>
                     <mchp:file name="hwtools/emu/AtmelIceScriptingBase.emu"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="tex">
                     <mchp:file name="hwtools/tex/PK4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/PKOBSKDEDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/RI4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/ICD4ToolBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/RIDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PK3OBDbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/SKDEManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PICkit2DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PICkit3DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/SnapToolImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/Pk4HybridTooImpl.toolMediator"/>
                     <mchp:file name="hwtools/tex/PgmToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/AtmelIceScriptingBase.toolMediator"/>
                     <mchp:file name="hwtools/tex/ICD3DbgToolManager.toolMediator"/>
                     <mchp:file name="hwtools/tex/PKOB4ToolImpl.toolMediator"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pkg">
                     <mchp:file name="hwtools/pkg/pkg.pkg"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="pk4">
                     <mchp:file name="hwtools/pk4/pk4.pk4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic16.persfr"/>
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                     <mchp:file name="hwtools/persfr/dspic.persfr"/>
                     <mchp:file name="hwtools/persfr/arm32.persfr"/>
                     <mchp:file name="hwtools/persfr/pic12.persfr"/>
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="per">
                     <mchp:file name="hwtools/per/pic18.per"/>
                     <mchp:file name="hwtools/per/pic32.per"/>
                     <mchp:file name="hwtools/per/dspic.per"/>
                     <mchp:file name="hwtools/per/pic16.per"/>
                     <mchp:file name="hwtools/per/armcm7.per"/>
                     <mchp:file name="hwtools/per/avr8.per"/>
                     <mchp:file name="hwtools/per/pic12.per"/>
                     <mchp:file name="hwtools/per/usart.ispPeripheral.xml"/>
                     <mchp:file name="hwtools/per/usart.plibgen.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="icd4">
                     <mchp:file name="hwtools/icd4/icd4.icd4"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="ice4">
                     <mchp:file name="hwtools/ice4/ice4.ice4"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML11E14A" title="Device page for ATSAML11E14A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML11E14A" title="Datasheet"/>
         </device>
